class SecondChapterText:
    @classmethod
    def chapter_2_start(cls, username):
        """ CONTINUE """
        return (f'<b>Глава 2: В тени леса</b>\n\n'
                f'Глаза {username} медленно закрываются, усталость и напряжение от приключений дня наконец начинают'
                f' догонять его. В темноте леса он чувствует себя относительно безопасным, но его разум все еще'
                f' напряжен, в ожидании новых угроз.\n\n Сон приходит мгновенно, и герой погружается в глубокие'
                f' сновидения, где прошлое и настоящее смешиваются в неразличимую кашу.'
                f' Сны наполняются образами утраченного мира'
                f' и зловещими тенями будущего. Пока герой спит, лес продолжает шептать свои темные тайны, а ночь'
                f' окутывает его своими чарующими, но опасными объятиями.')

    @classmethod
    def next(cls, username):
        """ CONTINUE """
        return (f'Когда {username} просыпается, первые лучи утреннего солнца проникают сквозь листву деревьев, освещая'
                f' окружающий лес своим теплым светом. Страшные сновидения исчезают, оставляя лишь'
                f' туманные воспоминания о прошедшей ночи.\n\n Осмотревшись вокруг, герой осознает, что ночь прошла'
                f' спокойно, без новых угроз или врагов. Он решает продолжить свой путь сквозь лес, ища выход из этого'
                f' заброшенного места и искавших его опасностей.\n\n Поднявшись на ноги, герой собирает свои силы,'
                f' готовясь к новым испытаниям, которые могут поджидать его впереди. Его душа наполнена решимостью'
                f' и надеждой на то, что где-то впереди его ждет спасение от этого кошмара, который обрушился на мир.')

    @classmethod
    def strange(cls, username):
        """ CONTINUE """
        return (f'Когда {username} выходит из густой части леса, перед ним открывается неожиданный вид.'
                f' Он оказывается на поляне, окруженной высокими деревьями. Солнечные лучи проникают'
                f' сквозь густые ветви, создавая игру света и тени на земле.\n\n'
                f' Но радость от открытия этой поляны быстро затмевается странным чувством.'
                f' Вдруг герой ощущает странное присутствие, как будто кто-то или что-то наблюдает за ним из темноты'
                f' леса.')

    @classmethod
    def figure(cls, username):
        """ CONTINUE """
        return (f'Герой осмотрелся вокруг, чувствуя на себе странный прилив тревоги. В тени между деревьями он заметил'
                f' неясную фигуру, стоящую неподвижно и наблюдающую за ним.\n\n Сердце {username} бешено забилось,'
                f' когда он встретился взглядом с этой загадочной фигурой. В свете леса его глаза сияли как парящие'
                f' огоньки, наполняя воздух таинственным светом.\n\n Но прежде чем герой успел приблизиться, фигура'
                f' внезапно повернулась и, словно тень, исчезла в глубине леса. Оставив лишь за собой слабый шорох'
                f' и ощущение неведомой угрозы.\n\n Вы решаете преследовать эту фигуру')

    @classmethod
    def lake(cls, username):
        """ CONTINUE """
        return (f'{username} бежал за таинственной фигурой сквозь лес, пока они не достигли небольшого озера,'
                f' заслоненного от глаз высокими деревьями. На берегу озера стоит старая деревянная лодка, покрытая'
                f' мхом и лишайником.\n\n Когда фигура добежала до озера и внезапно остановилась, герой наконец догнал'
                f' ее. С сердцем, бешено колотившимся в груди, он подошел к ней, напряженно вглядываясь в силуэт,'
                f' окутанный тенью.\n\n {username} обратился к ней:')

    @classmethod
    def who(cls, username):
        """ CONTINUE """
        return f'"Меня зовут Алиса", - произнесла она.\n\n Голос ее звучал глухо, как эхо в глубине леса.'

    @classmethod
    def dialogue(cls, username):
        """ CONTINUE """
        return (f'Герой: Меня зовут {username}. Я потерялся в этом лесу. А что ты здесь делаешь?\n\n'
                f'Алиса: Я живу здесь, в лесу. И ты не первый, кого я заметила в этом месте.\n\n'
                f'Герой: Здесь опасно быть одному. Ты не боишься?\n\n'
                f'Алиса: Я привыкла к этому месту. Иногда одиночество лучше, чем компания людей.\n\n'
                f'Герой: Может быть, я могу помочь тебе?\n\n'
                f'Алиса: Ты хочешь мне помочь? Неужели ты не боишься меня?\n\n'
                f'Герой: Я не боюсь. Я ищу выход из этого леса. Может быть, мы сможем помочь друг другу?\n\n'
                f'Алиса: Хорошо, {username}. Давай попытаемся найти выход вместе. Но будь осторожен,'
                f' в этом лесу есть много опасностей.\n\n'
                f'Герой: Благодарю тебя, Алиса. Я буду осторожен.\n\n'
                f'И так, {username} и Алиса решили объединить усилия в поисках выхода из таинственного леса.')

    @classmethod
    def zombies(cls, username):
        """ CONTINUE """
        return (f'По густому лесу {username} и Алиса продвигались медленно, каждый шаг окутывался напряжением и'
                f' ожиданием опасности. Ветви деревьев скрывали солнечные лучи, создавая зловещую атмосферу вокруг.\n\n'
                f' Внезапно из-за кустов впереди появилась группа теней, неясно рассматриваемых сквозь заросли.'
                f' Сердце {username} и Алисы застучало громче, когда тени приближались, раскрывая свою истинную форму'
                f' — это были зомби, жаждущие крови и плоти.\n\n {username} и Алиса мгновенно осознали опасность и'
                f' приготовились к борьбе. Среди деревьев раздался стон и шум, когда зомби, исходящие из темных глубин'
                f' леса, неумолимо приближались к ним, наполняя воздух запахом гнили и смерти.')

    @classmethod
    def fight(cls, username):
        """ VARIANT """
        return (f'<b>[ Действие ]</b>\n\n'
                f'{username} и Алиса решают не уступать перед опасностью и сражаться с зомби.'
                f' {username} достаёт нож.\n\n Стремясь выжить, они нападают на зомби с решимостью и отвагой,'
                f' готовые пойти на все, чтобы защитить себя и друг друга.')

    @classmethod
    def bandage(cls, username):
        """ CONTINUE """
        return (f'Убив всех монстров, {username} начинает осматривать их тела. Из кармана одного из мертвецов'
                f' выпадает чистый бинт. Вероятно в будущем он вам понадобится.')

    @classmethod
    def death_10(cls, username):
        """ DEATH """
        return (f'<b>[ Смерть ]</b>\n\n'
                f'Зомби разрывают {username} и Алису на части, пока те кричат от'
                f' невыносимой боли. Сегодня не ваш день.\n\n'
                f'/start - Заново.')

    @classmethod
    def run(cls, username):
        """ CONTINUE """
        return (f'Перед лицом опасности, {username} и Алиса решают не рисковать своими жизнями и выбирают'
                f' стратегию убежать. Они бросаются в бег, прокладывая путь сквозь густые заросли и мелькающие'
                f' деревья, стремясь держаться подальше от зомби. Страх и адреналин поглощают их, когда они ускоряют'
                f' шаг, пытаясь уйти от смертельной угрозы, подстерегающей их в темных лабиринтах леса.')

    @classmethod
    def old_house(cls, username):
        """ CONTINUE """
        return (f'Продвигаясь сквозь заросли, {username} и Алиса, наконец, добрались до старого,'
                f' заброшенного дома, который показался им как оазис в этом мире разрушения и смерти. Ветеран времени,'
                f' дом стоял, немного наклонившись в одну сторону, а его стены были покрыты мхом и пылью.\n\n'
                f' {username} и Алиса остановились перед порогом, ощущая мрачную атмосферу, и вошли внутрь, чувствуя '
                f'древнюю духовную сущность этого места. Старые мебельные предметы и покосившиеся стены'
                f' свидетельствовали о прошлом жизни дома, когда здесь еще жили люди.')

    @classmethod
    def radio(cls, username):
        """ CONTINUE """
        return (f'Помимо найденного в доме мусора, покопавшись, герои также нашли старое рабочее радио. {username}'
                f' решает воспользоваться им.')

    @classmethod
    def message(cls, username):
        """ CONTINUE """
        return (f'***Внимание, всем выжившим! Военная база организует эвакуацию из зоны опасности. Прошу всех выживших'
                f' немедленно отправиться к нам по следующим координатам: '
                f'[ 55.752° N, 37.617° E ]. Прибытие обязательно.'
                f' Необходимо принять меры к самозащите и срочно направиться к указанной'
                f' локации. Ваше выживание зависит от этого. Всем оставаться на связи и держаться в безопасности.***')

    @classmethod
    def talk(cls, username):
        """ CONTINUE """
        return (f'Алиса: Послушай, я думаю, нам стоит отправиться к той военной базе,'
                f' откуда доносились эти сообщения.\n\n'
                f'Герой: Да, согласен. Возможно, они могут помочь нам в этой ситуации.\n\n'
                f'По дороге к военной базе они продолжали обсуждать свои планы и надежды на помощь от военных.'
                f' Ночь приближалась, и путь казался все более опасным.')

    @classmethod
    def clear_base(cls, username):
        """ CONTINUE """
        return (f'Под покровом ночи героям удалось безопасно добраться до указанных координат военной базы.'
                f' Несмотря на темноту и тишину, они ожидали найти здесь спасение и помощь. Однако, прибыв на место,'
                f' им не удалось обнаружить ни одного живого существа. База казалась заброшенной и покинутой.\n\n'
                f' Герои осмотрели территорию, но нигде не было видно ни живой души, ни каких-либо признаков'
                f' активности. Внезапно их охватило чувство одиночества и безысходности, но они решили осмотреть базу.')

    @classmethod
    def door(cls, username):
        """ CONTINUE """
        return (f'{username}, не теряя времени, направился к входной двери главного здания базы, решив открыть её'
                f' и попытаться разгадать тайну. По прибытии к двери, герой замечает, что она заперта. Он понимает,'
                f' что для открытия двери нужно пройти кодовый замок.')

    @classmethod
    def task(cls, username):
        """ CONTINUE """
        return (f'<b>[ Количество попыток: 2 ]</b>\n\n'
                f'На двери военной базы вы видите надпись:\n\n "Для открытия двери введите результат'
                f' следующего выражения: [ 4 + 6 * 2 - 3 ]".\n\n Какой ответ нужно выбрать?')

    @classmethod
    def task_death(cls, username):
        """ DEATH """
        return (f'<b>[ Смерть ]</b>\n\n'
                f'{username}, не сумев правильно открыть дверь со второй попытки, внезапно слышит странный шум из'
                f' глубин базы. Затем, как из ниоткуда, раздаются странные звуки, похожие на щелчки и шипение.'
                f' В следующее мгновение дверь, которую он пытался открыть, внезапно разлетается на части,'
                f' оказываясь заминированной взрывчаткой. {username} разлетелся на части.\n\n'
                f'/start - Заново.')

    @classmethod
    def open_door(cls, username):
        """ CONTINUE """
        return (f'{username} и Алиса, открыв дверь, входят в главное здание базы и оказываются в пустом коридоре.'
                f' Видимых признаков жизни нет. Они обследуют помещение, но нигде не встречают никого. Странно,'
                f' но база кажется полностью пустой.\n\n Перед ними всплывает вопрос: зачем было отправлено сообщение?'
                f' Они решают обсудить дальнейшие действия. Алиса предполагает, что база могла автоматически'
                f' отправить сообщение. Возможно, в системе защиты произошла ошибка.\n'
                f'Герои решают осмотреть систему отправки сообщений.')

    @classmethod
    def system(cls, username):
        """ CONTINUE """
        return (f'{username} и Алиса продолжают исследование базы, надеясь найти какие-либо улики о происходящем'
                f'. Пока они перебирают документы и архивы, {username} попадаются документы с заголовком "Вирус".'
                f' Эти документы лежат у микрофона системы, что кажется странным и вызывает подозрения. Оказывается,'
                f' что сообщение действительно было отправлено автоматически.\n\n'
                f' Герой обращает внимание на эти документы и начинает их изучать. В них описывается вирус,'
                f' атаковавший некогда живых людей,'
                f' который, по всей видимости, является предметом исследований и'
                f' тестирования в каком-то научном комплексе.')

    @classmethod
    def document(cls, username):
        """ HISTORY """
        return (f'<b>[ История ]</b>\n\n'
                f'Научный документ:\n'
                f'<b>Исследование вируса "Протеус-19" в научно-исследовательском комплексе "Сибирь"</b>\n'
                f"Тамбов, Координаты: [ 45°18'34.6N 75°53'07.4W ]\n\n"
                f'Заголовок:\n'
                f'Протоколы тестирования и анализа вируса "Протеус-19"\n\n'
                f'Авторы:\n'
                f'Доктор Александр Ютченко, профессор биологии\n'
                f'Доктор Владимир Чернышов, ведущий вирусолог\n\n'
                f'Основные результаты:\n'
                f'Вирус "Протеус-19" представляет собой новый вирусный штамм, отличающийся высокой мутагенной'
                f' активностью и способностью к быстрому распространению.'
                f'Структурный анализ показывает, что вирус обладает высокой вирулентностью и может вызывать серьезные'
                f' системные нарушения у человека. Проведенные эксперименты свидетельствуют о возможности передачи'
                f' вируса через воздушно-капельный и контактный пути,'
                f' что делает его особенно опасным для популяции.\n\n'
                f'Выводы и рекомендации:\n'
                f'Учитывая вышеуказанные результаты, необходимо принять срочные меры'
                f' для предотвращения распространения вируса.'
                f'Рекомендуется усилить мониторинг и контроль за людьми, находящимися в зоне риска,'
                f' а также провести дополнительные исследования для выявления'
                f' эффективных методов профилактики и лечения.'
                f'Необходимо скоординировать усилия с медицинскими и научными организациями'
                f' для разработки вакцин и лекарственных препаратов против вируса "Протеус-19".\n\n'
                f'Примечание:\n'
                f'Данные результаты подлежат дополнительной проверке и верификации. Они могут быть использованы'
                f' только для научных исследований и не предполагают медицинской диагностики или лечения.')

    @classmethod
    def complex(cls, username):
        """ CONTINUE """
        return (f'После обнаружения документов о вирусе "Протеус-19" в научном комплексе "Сибирь", {username} и Алиса'
                f' осознали необходимость найти защиту и разгадать загадку таинственного сообщения, отправленного'
                f' из базы. Сознавая, что научный комплекс может стать ключом к пониманию происходящего и выживанию,'
                f' они решают отправиться по полученным координатам в "Сибирь".')

    @classmethod
    def hangar(cls, username):
        """ CONTINUE """
        return (f'Покинув главное здание военной базы, герои направились к ангару, надеясь найти в нем что-то'
                f' полезное для своего путешествия. Когда они вошли в ангар, взгляды героев немедленно притянула'
                f' старая машина, стоящая на фоне тусклого света.\n\n Машина выглядела заброшенной и пыльной,'
                f' с повреждениями и признаками долгого бездействия. Вмятины на кузове, потертая краска и'
                f' разбитые стекла свидетельствовали о непростом прошлом этого транспортного средства.'
                f' Тем не менее, герои видели в этой машине потенциал - возможность добраться до места,'
                f' где они намеревались исследовать следующий этап своего путешествия.')

    @classmethod
    def car(cls, username):
        """ CONTINUE """
        return (f'Когда герои сели в машину, они обнаружили, что ее двигатель не заводится. Взгляды героев'
                f' переключились на приборную панель, где виднелись различные переключатели и кнопки. Они поняли,'
                f' что перед ними стоит задача запустить машину, чтобы продолжить свой путь.\n\n'
                f'{username}, смотря на приборную панель, видел следующие варианты:')

    @classmethod
    def drive(cls, username):
        """ CONTINUE """
        return (f'Герои решили применить несколько изобретательных методов, чтобы завести машину и покинуть'
                f' территорию базы. После нескольких неудачных попыток они решили проверить аккумулятор и'
                f' подключить провода, как предложено системой в одном из вариантов. К счастью, это сработало,'
                f' и двигатель загудел, оживившись после долгого перерыва.')

    @classmethod
    def road(cls, username):
        """ CONTINUE """
        return (f'Выехав за территорию военной базы, Алиса спросила у {username}, по какой дороге'
                f' им стоит поехать - асфальтированной через город/грунтовой через лес.\n\n'
                f'{username} необходимо принять решение и выбрать путь.')

    @classmethod
    def cliff(cls, username):
        """ DEATH """
        return (f'<b>[ Смерть ]</b>\n\n'
                f'{username} решил поехать по грунтовой дороге, посчитав этот путь менее заметным.'
                f' Однако на пути герой не справился с управлением и вылетел с дороги в обрыв.'
                f' Герои разбились насмерть.\n\n'
                f'/start - Заново.')

    @classmethod
    def asphalt(cls, username):
        """ CONTINUE """
        return (f'{username} решил поехать по асфальтированной дороге, посчитав этот путь более безопасным.'
                f' Так оно и оказалось - герои без особых проблем проехали большую часть пути'
                f' и им оставалось совсем немного.')
